Using TensorFlow backend.

2022-05-18 13:47:09.658251: I C:\tf_jenkins\workspace\rel-win\M\windows\PY\36\tensorflow\core\platform\cpu_feature_guard.cc:140] 
Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 16, 16, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 16, 32)   288         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 16, 16, 32)   128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, 16, 16, 32)   8192        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 16, 16)   4608        p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 16, 16, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, 16, 16, 16)   4096        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 16, 16, 8)    1152        p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 16, 16, 8)    32          conv2d_3[0][0]                   
__________________________________________________________________________________________________
p_re_lu_3 (PReLU)               (None, 16, 16, 8)    2048        batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 16, 1)    72          p_re_lu_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16, 16, 1)    4           conv2d_4[0][0]                   
__________________________________________________________________________________________________
p_re_lu_4 (PReLU)               (None, 16, 16, 1)    256         batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 1)    4           p_re_lu_4[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 16, 16, 1)    0           input_1[0][0]                    
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
p_re_lu_5 (PReLU)               (None, 16, 16, 1)    256         add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 32)   288         p_re_lu_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 32)   128         conv2d_5[0][0]                   
__________________________________________________________________________________________________
p_re_lu_6 (PReLU)               (None, 16, 16, 32)   8192        batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 16)   4608        p_re_lu_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16, 16, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
p_re_lu_7 (PReLU)               (None, 16, 16, 16)   4096        batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 8)    1152        p_re_lu_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 8)    32          conv2d_7[0][0]                   
__________________________________________________________________________________________________
p_re_lu_8 (PReLU)               (None, 16, 16, 8)    2048        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 1)    72          p_re_lu_8[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 1)    4           conv2d_8[0][0]                   
__________________________________________________________________________________________________
p_re_lu_9 (PReLU)               (None, 16, 16, 1)    256         batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 1)    4           p_re_lu_9[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 16, 16, 1)    0           p_re_lu_5[0][0]                  
                                                                 batch_normalization_10[0][0]     
__________________________________________________________________________________________________
p_re_lu_10 (PReLU)              (None, 16, 16, 1)    256         add_2[0][0]                      
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 256)          0           p_re_lu_10[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          131584      flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 256)          131328      dense_1[0][0]                    
==================================================================================================
Total params: 305,312
Trainable params: 305,080
Non-trainable params: 232
__________________________________________________________________________________________________









